## Instructor Demo: Data Cleaning
This program reads in a CSV file, and perfoms a number of data quality checks. Data values that fail the checks are then cleansed.

In [20]:
# Initial imports
import pandas as pd
from pathlib import Path

### Read in CSV and take a sample

In [21]:
# Take sample of data
csv_path = Path("../Resources/order_data.csv")
#csv_data = pd.read_csv(csv_path, index_col="order_no")
csv_data = pd.read_csv(csv_path)

csv_data.sample(5)

     order_no customer_no order_total  order_date
4   413853121    CM458565         NaN   4/24/2019
0   452517125    CM458565     $141.25  01-10-2019
6     2356363        2124   258936.12  04-29-2019
3  4465241327     AK45765    $1103.36  04-25-2019
1    45251825    CJ458565       14.00  04/25/2019

### Identify DataFrame Data Types

In [22]:
# Retrieve DataFrame data types
csv_data.dtypes

order_no        int64
customer_no    object
order_total    object
order_date     object
dtype: object

### Assess data quality by identifying the number of rows

In [23]:
# Identify Series count by counting number of rows in each column
#csv_data.count()
csv_data_count = csv_data.count()

#csv_data.sample()
csv_data_count

order_no       8
customer_no    7
order_total    7
order_date     8
dtype: int64

### Assess data quality by identifying the number of times a value occurs

In [24]:
# Identify frequency of values
csv_data["customer_no"].value_counts()

AK45765     2
CM458565    2
2124        1
CJ458565    1
TV4663      1
Name: customer_no, dtype: int64

### Assess data quality by checking for nulls

In [25]:
# Check for null values
csv_data.isnull()

   order_no  customer_no  order_total  order_date
0     False        False        False       False
1     False        False        False       False
2     False        False        False       False
3     False        False        False       False
4     False        False         True       False
5     False        False        False       False
6     False        False        False       False
7     False         True        False       False

### Assess data quality by determining the percentage of nulls

In [26]:
# Determine percentage of nulls
csv_data.isnull().mean() * 100

order_no        0.0
customer_no    12.5
order_total    12.5
order_date      0.0
dtype: float64

### Assess data quality by determining the number of nulls

In [27]:
# Determine number of nulls by ading sum of all 'true's for each column
csv_data.isnull().sum()

order_no       0
customer_no    1
order_total    1
order_date     0
dtype: int64

### Cleanse data by filling nulls with default value (i.e. "Unknown", 0, or mean() is common)

In [28]:
# Cleanse nulls from DataFrame by filling na
csv_data["customer_no"] = csv_data["customer_no"].fillna("Unknown")
csv_data

     order_no customer_no order_total  order_date
0   452517125    CM458565     $141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765    $1103.36  04-25-2019
3  4465241327     AK45765    $1103.36  04-25-2019
4   413853121    CM458565         NaN   4/24/2019
5    45235825      TV4663       65.42  04-29-2019
6     2356363        2124   258936.12  04-29-2019
7   452519232     Unknown     $141.25  01-10-2019

### Cleanse data by dropping nulls

In [32]:
# Cleaning nulls from DataFrame by dropping ; created new DF
csv_data_new = csv_data.dropna()
csv_data_new

     order_no customer_no order_total  order_date
0   452517125    CM458565     $141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765    $1103.36  04-25-2019
3  4465241327     AK45765    $1103.36  04-25-2019
5    45235825      TV4663       65.42  04-29-2019
6     2356363        2124   258936.12  04-29-2019
7   452519232     Unknown     $141.25  01-10-2019

In [33]:
# original DF remains untouched.
csv_data

     order_no customer_no order_total  order_date
0   452517125    CM458565     $141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765    $1103.36  04-25-2019
3  4465241327     AK45765    $1103.36  04-25-2019
4   413853121    CM458565         NaN   4/24/2019
5    45235825      TV4663       65.42  04-29-2019
6     2356363        2124   258936.12  04-29-2019
7   452519232     Unknown     $141.25  01-10-2019

### Checking number of nulls again

In [34]:
csv_data_new.isnull().sum()

order_no       0
customer_no    0
order_total    0
order_date     0
dtype: int64

### Assess data quality by checking for duplicate rows

In [13]:
# Check duplicates
csv_data_new.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
dtype: bool

### Assess data quality by checking for duplicate customer_no values

In [14]:
# Check duplicates for specific field
csv_data_new["customer_no"].duplicated()

0    False
1    False
2    False
3     True
4     True
5    False
6    False
7    False
Name: customer_no, dtype: bool

In [35]:
csv_data_new

     order_no customer_no order_total  order_date
0   452517125    CM458565     $141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765    $1103.36  04-25-2019
3  4465241327     AK45765    $1103.36  04-25-2019
5    45235825      TV4663       65.42  04-29-2019
6     2356363        2124   258936.12  04-29-2019
7   452519232     Unknown     $141.25  01-10-2019

In [36]:
# Check duplicates for a combination of fields
csv_data_check = csv_data[csv_data.duplicated(['customer_no', 'order_no'])]
csv_data_check

     order_no customer_no order_total  order_date
3  4465241327     AK45765    $1103.36  04-25-2019

In [37]:
csv_data_new

     order_no customer_no order_total  order_date
0   452517125    CM458565     $141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765    $1103.36  04-25-2019
3  4465241327     AK45765    $1103.36  04-25-2019
5    45235825      TV4663       65.42  04-29-2019
6     2356363        2124   258936.12  04-29-2019
7   452519232     Unknown     $141.25  01-10-2019

### Cleanse data by dropping duplicates

In [41]:
# Clean duplicates
csv_data_new = csv_data_new.drop_duplicates().copy()

### Assess data quality by using `head` function to sample data and identify currency symbols

In [42]:
# Identify if numeric field with $ symbol
csv_data_new.head()

     order_no customer_no order_total  order_date
0   452517125    CM458565     $141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765    $1103.36  04-25-2019
5    45235825      TV4663       65.42  04-29-2019
6     2356363        2124   258936.12  04-29-2019

In [43]:
csv_data_new["order_total"].sum()

'$141.2514.00$1103.3665.42258936.12$141.25'

### Cleanse data by replacing currency symbols

In [44]:
# Clean identified numeric fields with $ symbol
csv_data_new["order_total"] = csv_data_new["order_total"].str.replace("$", "")
csv_data_new["order_total"]

<ipython-input-44-e2af8adf3b8a>:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  csv_data_new["order_total"] = csv_data_new["order_total"].str.replace("$", "")

0       141.25
1        14.00
2      1103.36
5        65.42
6    258936.12
7       141.25
Name: order_total, dtype: object

In [45]:
#check current pandsas version
pd.__version__

'1.2.1'

In [46]:
# Retrieve data types to confirm what needs to be converted
csv_data_new.dtypes

order_no        int64
customer_no    object
order_total    object
order_date     object
dtype: object

In [49]:
# Convert `order_total` from `object` to `float`
csv_data_new["order_total"] = csv_data_new["order_total"].astype("float")

In [50]:
# Confirm conversion worked as expected
csv_data_new.dtypes

order_no         int64
customer_no     object
order_total    float64
order_date      object
dtype: object

In [51]:
csv_data_new["order_total"].sum()

260401.4